sdaiNext(Sdai_ItrId*)
\details
Moves the position of a specified iterator to the next element in the aggregate instance.
\param iterator [in] An iterator to set the position.
\returns sdaiTRUE if the next element exists and became the current; otherwise, the function returns sdaiFALSE.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiIR_NEXS - Iterator does not exist.
* sdaiAI_NSET - Aggregate instance is empty.
* sdaiSY_ERR - Underlying system error.
\code
SdaiSet extent = sdaiGetEntityExtentBN(pModel, "ifcsiunit");
SdaiIterator it = sdaiCreateIterator(extent);
for (sdaiBeginning(it); sdaiNext(it); )
{
...
}
...
sdaiDeleteIterator(it);